---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTableIterator.IsDone
source: html/8e96907d-8e96-067e-4fe5-d497656bce07.htm
---
# Autodesk.Revit.DB.ExportFontTableIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.